src/cf/DataProcessors/new_АРМ_ЭлектроннаяОчередь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>new_АРМ_ЭлектроннаяОчередь</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/new_ЭлектроннаяОчередь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>new_ЭлектроннаяОчередь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.new_СтатусыЭлектроннойОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТалона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.new_РабочиеМестаЭлектроннойОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/new_СтатусыЭлектроннойОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>new_СтатусыЭлектроннойОчереди</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВСборке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКВыдаче</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/new_РабочиеМестаЭлектроннойОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>new_РабочиеМестаЭлектроннойОчереди</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОкна</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Операторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сборщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/new_АРМ_ЭлектроннаяОчередь/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// 2026.06.04 [Task-1]
	
	ЭтоОператор = Ложь;
	ЭтоСборщик  = Ложь;
	
	УстановитьРабочееМесто(ЭтоОператор, ЭтоСборщик);
	УстановитьОтборыЭлектроннойОчереди(ЭтоОператор, ЭтоСборщик);
	
	Если ЭтоОператор = Ложь И ЭтоСборщик = Истина Тогда
		Элементы.ГруппаКоманды.Видимость = Ложь;
	ИначеЕсли ЭтоОператор = Ложь И ЭтоСборщик = Ложь Тогда
		Элементы.ГруппаОсновная.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// 2026.06.04 [Task-1]
	
	ПодключитьОбработчикОжидания("ОбновитьОчередьКлиент", 5, Ложь);
	
КонецПроцедуры

#КонецОбласти	   

#Область ОбработчикиКомандФормы
	
&НаКлиенте
Процедура ВСборке(Команда)
	
	// 2026.06.04 [Task-1]
	
	ТекДанные = Элементы.Очередь.ТекущиеДанные;
	Заказ 	  = ТекДанные.Заказ;
	
	СтатусОчереди = ПредопределенноеЗначение("Перечисление.new_СтатусыЭлектроннойОчереди.ВСборке");
	УстановитьСтатусОчередиКлиент(Заказ, СтатусОчереди);
	
	СтатусЗаказа = ПредопределенноеЗначение("Перечисление.СостоянияЗаказов.ВРаботе");
	УстрановитьСтатусЗаказаСервер(Заказ, СтатусЗаказа);
	
КонецПроцедуры 

&НаКлиенте
Процедура ГотовКВыдаче(Команда)
	
	// 2026.06.04 [Task-1]
	
	ТекДанные = Элементы.Очередь.ТекущиеДанные;
	Заказ 	  = ТекДанные.Заказ;
	
	СтатусОчереди = ПредопределенноеЗначение("Перечисление.new_СтатусыЭлектроннойОчереди.ГотовКВыдаче");
	УстановитьСтатусОчередиКлиент(Заказ, СтатусОчереди);
	
	СтатусЗаказа = ПредопределенноеЗначение("Перечисление.СостоянияЗаказов.Выполнен");
	УстрановитьСтатусЗаказаСервер(Заказ, СтатусЗаказа);
	
КонецПроцедуры  

&НаКлиенте
Процедура Завершен(Команда)
	
	// 2026.06.04 [Task-1]
	
	ТекДанные = Элементы.Очередь.ТекущиеДанные;
	Заказ 	  = ТекДанные.Заказ;
	
	СтатусОчереди = ПредопределенноеЗначение("Перечисление.new_СтатусыЭлектроннойОчереди.Завершен");
	УстановитьСтатусОчередиКлиент(Заказ, СтатусОчереди);
	
	СтатусЗаказа = ПредопределенноеЗначение("Перечисление.СостоянияЗаказов.Закрыт");
	УстрановитьСтатусЗаказаСервер(Заказ, СтатусЗаказа);

КонецПроцедуры

&НаКлиенте
Процедура Отменен(Команда)
	
	// 2026.06.04 [Task-1]
	
	ТекДанные = Элементы.Очередь.ТекущиеДанные;
	Заказ 	  = ТекДанные.Заказ;
	
	СтатусОчереди = ПредопределенноеЗначение("Перечисление.new_СтатусыЭлектроннойОчереди.Отменен");
	УстановитьСтатусОчередиКлиент(Заказ, СтатусОчереди);
	
	СтатусЗаказа = ПредопределенноеЗначение("Перечисление.СостоянияЗаказов.ПустаяСсылка");
	УстрановитьСтатусЗаказаСервер(Заказ, СтатусЗаказа);
	
КонецПроцедуры


#КонецОбласти

&НаКлиенте
Процедура ОбновитьОчередьКлиент()
	
	// 2026.06.04 [Task-1]
	
	Элементы.Очередь.Обновить();	
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСтатусСервер(СтатусОчереди, Заказ, ТекстОшибки)
	
	// 2026.06.04 [Task-1]
	
	СтрОчередь = Новый Структура;
	СтрОчередь.Вставить("РабочееМесто", Неопределено);
	СтрОчередь.Вставить("Заказ", 		Неопределено);
	СтрОчередь.Вставить("Статус", 		Неопределено);
	СтрОчередь.Вставить("НомерТалона",  Неопределено);
	
	НомерТалонаМаксимум = 0;
	Склад = ЭтаФорма.РабочееМесто.Склад;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	new_ЭлектроннаяОчередь.РабочееМесто КАК РабочееМесто,
		|	new_ЭлектроннаяОчередь.Заказ КАК Заказ,
		|	new_ЭлектроннаяОчередь.Статус КАК Статус,
		|	new_ЭлектроннаяОчередь.НомерТалона КАК НомерТалона,
		|	new_ЭлектроннаяОчередь.Склад КАК Склад
		|ИЗ
		|	РегистрСведений.new_ЭлектроннаяОчередь КАК new_ЭлектроннаяОчередь
		|ГДЕ
		|	new_ЭлектроннаяОчередь.Заказ = &Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(new_ЭлектроннаяОчередь.НомерТалона) КАК НомерТалона
		|ИЗ
		|	РегистрСведений.new_ЭлектроннаяОчередь КАК new_ЭлектроннаяОчередь
		|ГДЕ
		|	new_ЭлектроннаяОчередь.Склад = &Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	new_ЭлектроннаяОчередь.Заказ КАК Заказ
		|ИЗ
		|	РегистрСведений.new_ЭлектроннаяОчередь КАК new_ЭлектроннаяОчередь
		|ГДЕ
		|	new_ЭлектроннаяОчередь.Склад = &Склад
		|	И new_ЭлектроннаяОчередь.Статус = ЗНАЧЕНИЕ(Перечисление.new_СтатусыЭлектроннойОчереди.ВСборке)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	new_ЭлектроннаяОчередь.Заказ КАК Заказ
		|ИЗ
		|	РегистрСведений.new_ЭлектроннаяОчередь КАК new_ЭлектроннаяОчередь
		|ГДЕ
		|	new_ЭлектроннаяОчередь.Склад = &Склад
		|	И new_ЭлектроннаяОчередь.Статус = ЗНАЧЕНИЕ(Перечисление.new_СтатусыЭлектроннойОчереди.ГотовКВыдаче)
		|	И new_ЭлектроннаяОчередь.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	//Запрос.УстановитьПараметр("РабочееМесто", ЭтаФорма.РабочееМесто);
    Запрос.УстановитьПараметр("Склад", Склад);
	
	Пакеты = Запрос.ВыполнитьПакет(); 
	
	ВыборкаЗаказы = Пакеты[0].Выбрать();
	ВыборкаНомера = Пакеты[1].Выбрать();
	ЗаказыВСборке = Пакеты[2];
	ЗаказыКВыдаче = Пакеты[3];
	
	Пока ВыборкаНомера.Следующий() Цикл
		НомерТалонаМаксимум = ВыборкаНомера.НомерТалона; 
	КонецЦикла;
	
	Пока ВыборкаЗаказы.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтрОчередь, ВыборкаЗаказы); 
	КонецЦикла;
	
	Если СтатусОчереди = Перечисления.new_СтатусыЭлектроннойОчереди.ВСборке Тогда
		Если СтрОчередь.РабочееМесто = Неопределено Или СтрОчередь.РабочееМесто = Справочники.new_РабочиеМестаЭлектроннойОчереди.ПустаяСсылка() Тогда
			Если Не ЗаказыВСборке.Пустой() Тогда
				ТекстОшибки = "Уже существует заказ в статусе ""В сборке"". Закончите его оформление";
				Возврат;
			КонецЕсли;	
			
			Менеджер 			  = РегистрыСведений.new_ЭлектроннаяОчередь.СоздатьМенеджерЗаписи();
			Менеджер.Заказ 		  = Заказ;
			Менеджер.РабочееМесто = ЭтаФорма.РабочееМесто;
			Менеджер.НомерТалона  = НомерТалонаМаксимум + 1;
			Менеджер.Статус 	  = СтатусОчереди;
			Менеджер.Склад        = Склад;
			
			Менеджер.Записать();
		Иначе
			ТекстОшибки = "Заказ отменен или уже находится в сборке";
			Возврат;
		КонецЕсли;
	ИначеЕсли СтатусОчереди = Перечисления.new_СтатусыЭлектроннойОчереди.ГотовКВыдаче Тогда
		
		Если СтрОчередь.РабочееМесто = Неопределено Или СтрОчередь.РабочееМесто = Справочники.new_РабочиеМестаЭлектроннойОчереди.ПустаяСсылка() Тогда
			ТекстОшибки = "Заказ не в сборке. Действие недоступно";
			Возврат;
		Иначе	
			Если СтрОчередь.РабочееМесто <> ЭтаФорма.РабочееМесто Или СтрОчередь.Статус <> Перечисления.new_СтатусыЭлектроннойОчереди.ВСборке Тогда
				ТекстОшибки = "Заказ не в сборке. Действие недоступно";
				Возврат;	
			Иначе	
				Менеджер 			  = РегистрыСведений.new_ЭлектроннаяОчередь.СоздатьМенеджерЗаписи();
				Менеджер.Заказ 		  = Заказ;
				Менеджер.РабочееМесто = ЭтаФорма.РабочееМесто;
				Менеджер.НомерТалона  = СтрОчередь.НомерТалона;
				Менеджер.Статус 	  = СтатусОчереди;
				Менеджер.Склад        = Склад;
				
				Менеджер.Записать();	
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли СтатусОчереди = Перечисления.new_СтатусыЭлектроннойОчереди.Завершен Тогда	
		Если ЗаказыКВыдаче.Пустой() Тогда
			ТекстОшибки = "Заказ еще не выдан. Действие недоступно";
			Возврат;	
		КонецЕсли;	
		
		Менеджер 			  = РегистрыСведений.new_ЭлектроннаяОчередь.СоздатьМенеджерЗаписи();
		Менеджер.Заказ 		  = Заказ;
		Менеджер.РабочееМесто = ЭтаФорма.РабочееМесто;
		Менеджер.НомерТалона  = СтрОчередь.НомерТалона;
		Менеджер.Статус 	  = СтатусОчереди;
		Менеджер.Склад        = Склад;
		
		Менеджер.Записать();
	Иначе
		Менеджер 			  = РегистрыСведений.new_ЭлектроннаяОчередь.СоздатьМенеджерЗаписи();
		Менеджер.Заказ 		  = Заказ;
		Менеджер.РабочееМесто = ЭтаФорма.РабочееМесто;
		Менеджер.НомерТалона  = СтрОчередь.НомерТалона;
		Менеджер.Статус 	  = СтатусОчереди;
		Менеджер.Склад        = Склад;
		
		Менеджер.Записать();	
	КонецЕсли;	
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьСтатусОчередиКлиент(Заказ, СтатусОчереди)
    
	// 2026.06.04 [Task-1]
	
	ТекстОшибки = "";
	УстановитьСтатусСервер(СтатусОчереди, Заказ, ТекстОшибки);
	
	Если ТекстОшибки <> "" Тогда
		ПоказатьПредупреждение(, ТекстОшибки); 	
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура УстрановитьСтатусЗаказаСервер(Заказ, СтатусЗаказа)
	
    // 2026.06.04 [Task-1]
	
	ЗаказОбъект = Заказ.ПолучитьОбъект();
	
	Если СтатусЗаказа = Перечисления.СостоянияЗаказов.ПустаяСсылка() Тогда
		ЗаказОбъект.УстановитьПометкуУдаления(Истина);
	Иначе
		ЗаказОбъект.СостояниеЗаказа = СтатусЗаказа;
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРабочееМесто(ЭтоОператор, ЭтоСборщик)
	
	// 2026.06.04 [Task-1]
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочиеМестаЭлектроннойОчереди.Ссылка КАК РабочееМесто
		|ИЗ
		|	Справочник.new_РабочиеМестаЭлектроннойОчереди КАК РабочиеМестаЭлектроннойОчереди
		|ГДЕ
		|	РабочиеМестаЭлектроннойОчереди.ПометкаУдаления = ЛОЖЬ
		|	И РабочиеМестаЭлектроннойОчереди.Операторы.Пользователь = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочиеМестаЭлектроннойОчереди.Ссылка КАК РабочееМесто
		|ИЗ
		|	Справочник.new_РабочиеМестаЭлектроннойОчереди КАК РабочиеМестаЭлектроннойОчереди
		|ГДЕ
		|	РабочиеМестаЭлектроннойОчереди.ПометкаУдаления = ЛОЖЬ
		|	И РабочиеМестаЭлектроннойОчереди.Сборщики.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
	
	Пакеты = Запрос.ВыполнитьПакет();
	
	ВыборкаОператоры = Пакеты[0].Выбрать();
	
	Пока ВыборкаОператоры.Следующий() Цикл
		ЭтаФорма.РабочееМесто = ВыборкаОператоры.РабочееМесто;
		ЭтоОператор = Истина;
	КонецЦикла; 
	
	ВыборкаСборщики = Пакеты[1].Выбрать();
	
	Пока ВыборкаСборщики.Следующий() Цикл
		ЭтаФорма.РабочееМесто = ВыборкаСборщики.РабочееМесто;
		ЭтоСборщик = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыЭлектроннойОчереди(ЭтоОператор, ЭтоСборщик)
	
	// 2026.06.04 [Task-1]
	
	СписокОтбора = Новый Массив;
	СписокОтбора.Добавить(ЭтаФорма.РабочееМесто);
	СписокОтбора.Добавить(Справочники.new_РабочиеМестаЭлектроннойОчереди.ПустаяСсылка());
	
	Склад = ЭтаФорма.РабочееМесто.Склад; 
	
	ЭлементОтбора 				   = Очередь.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("РабочееМесто");
	ЭлементОтбора.ВидСравнения 	   = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование    = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение   = СписокОтбора;

	ЭлементОтбора 				   = Очередь.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Склад");
	ЭлементОтбора.ВидСравнения 	   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование    = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение   = Склад;
	
	Если ЭтоОператор Тогда
		СписокОтбора = Новый Массив;
		СписокОтбора.Добавить(Перечисления.new_СтатусыЭлектроннойОчереди.ВСборке);
		СписокОтбора.Добавить(Перечисления.new_СтатусыЭлектроннойОчереди.ГотовКВыдаче);
		СписокОтбора.Добавить(Перечисления.new_СтатусыЭлектроннойОчереди.ПустаяСсылка());
		
		ЭлементОтбора 				   = Очередь.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Статус");
		ЭлементОтбора.ВидСравнения 	   = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование    = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ПравоеЗначение   = СписокОтбора;
	ИначеЕсли ЭтоСборщик Тогда 
		ЭлементОтбора 				   = Очередь.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Статус");
		ЭлементОтбора.ВидСравнения 	   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование    = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ПравоеЗначение   = Перечисления.new_СтатусыЭлектроннойОчереди.ВСборке;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
